[
  {
    "id": "hi-001",
    "languageCode": "hi-IN",
    "languageName": "Hindi",
    "idiom": "आँख का तारा",
    "meaningEn": "The apple of one's eye; someone who is very dear",
    "exampleNative": "मेरा बेटा मेरी आँख का तारा है।",
    "exampleEn": "My son is the apple of my eye.",
    "transliteration": "aankh ka taara",
    "origin": "This idiom comes from the fact that the pupil of the eye (तारा - taara) is the most precious and protected part of the eye, reflecting how we protect those we love most dearly."
  },
  {
    "id": "es-001",
    "languageCode": "es-ES",
    "languageName": "Spanish",
    "idiom": "Estar en las nubes",
    "meaningEn": "To be daydreaming; to have one's head in the clouds",
    "exampleNative": "Juan siempre está en las nubes durante la clase.",
    "exampleEn": "Juan is always daydreaming during class.",
    "transliteration": "",
    "origin": "This expression dates back to medieval Spain when people believed that dreamers and distracted individuals had their minds floating up in the sky, disconnected from earthly reality."
  },
  {
    "id": "fr-001",
    "languageCode": "fr-FR",
    "languageName": "French",
    "idiom": "Avoir le cafard",
    "meaningEn": "To feel depressed or down (literally: to have the cockroach)",
    "exampleNative": "Elle a le cafard depuis qu'elle a perdu son emploi.",
    "exampleEn": "She's been feeling down since she lost her job.",
    "transliteration": "",
    "origin": "Originating in 19th century France, this idiom compares depression to carrying a cockroach - something unwanted and unpleasant that weighs you down. Poet Charles Baudelaire helped popularize this expression."
  },
  {
    "id": "de-001",
    "languageCode": "de-DE",
    "languageName": "German",
    "idiom": "Tomaten auf den Augen haben",
    "meaningEn": "To be oblivious (literally: to have tomatoes on your eyes)",
    "exampleNative": "Du hast wohl Tomaten auf den Augen! Das Auto steht direkt vor dir!",
    "exampleEn": "You must be blind! The car is right in front of you!",
    "transliteration": "",
    "origin": "This colorful German expression emerged in the 20th century, suggesting that having tomatoes on your eyes would block your vision entirely, making you unable to see obvious things right in front of you."
  },
  {
    "id": "ko-001",
    "languageCode": "ko-KR",
    "languageName": "Korean",
    "idiom": "식은 죽 먹기",
    "meaningEn": "A piece of cake (literally: eating cold porridge)",
    "exampleNative": "이 시험은 나에게 식은 죽 먹기였어.",
    "exampleEn": "This exam was a piece of cake for me.",
    "transliteration": "sigeun juk meokgi",
    "origin": "In traditional Korean culture, cold porridge (juk) was considered the easiest food to consume - requiring no chewing and no waiting for it to cool. This made it the perfect metaphor for something effortlessly simple."
  },
  {
    "id": "ja-001",
    "languageCode": "ja-JP",
    "languageName": "Japanese",
    "idiom": "猫の手も借りたい",
    "meaningEn": "To be extremely busy (literally: want to borrow even a cat's paws)",
    "exampleNative": "今日は猫の手も借りたいほど忙しい。",
    "exampleEn": "Today I'm so busy I could use even a cat's help.",
    "transliteration": "neko no te mo karitai",
    "origin": "This expression reflects the Japanese agricultural tradition where during harvest season, farmers were so overwhelmed they would welcome help from anyone - even a cat, despite cats being notoriously unhelpful workers."
  },
  {
    "id": "zh-001",
    "languageCode": "zh-CN",
    "languageName": "Mandarin Chinese",
    "idiom": "画蛇添足",
    "meaningEn": "To ruin something by adding unnecessary details (literally: draw a snake and add feet)",
    "exampleNative": "你这样做只是画蛇添足。",
    "exampleEn": "What you're doing is just adding unnecessary details.",
    "transliteration": "huà shé tiān zú",
    "origin": "This idiom comes from an ancient Chinese story where men competed to draw snakes quickly. The winner, having finished first, decided to add feet to his snake. Since snakes don't have feet, he was disqualified for ruining a perfect drawing."
  },
  {
    "id": "ar-001",
    "languageCode": "ar-SA",
    "languageName": "Arabic",
    "idiom": "يد واحدة لا تصفق",
    "meaningEn": "It takes two to tango (literally: one hand doesn't clap)",
    "exampleNative": "لا يمكننا حل هذه المشكلة بمفردنا، يد واحدة لا تصفق.",
    "exampleEn": "We can't solve this problem alone; it takes two.",
    "transliteration": "yad wahida la tusaffiq",
    "origin": "This ancient Arabic proverb emphasizes the importance of cooperation and mutual effort. Just as clapping requires two hands coming together, resolving conflicts or achieving goals often requires collaboration between parties."
  },
  {
    "id": "ru-001",
    "languageCode": "ru-RU",
    "languageName": "Russian",
    "idiom": "Повесить нос",
    "meaningEn": "To be sad or dejected (literally: to hang one's nose)",
    "exampleNative": "После провала экзамена он повесил нос.",
    "exampleEn": "After failing the exam, he became dejected.",
    "transliteration": "povesit' nos",
    "origin": "This Russian expression comes from observing body language - when someone is sad or disappointed, their head droops down, making their nose point downward as if it were 'hanging.' The phrase became popular in 19th century Russian literature."
  },
  {
    "id": "it-001",
    "languageCode": "it-IT",
    "languageName": "Italian",
    "idiom": "In bocca al lupo",
    "meaningEn": "Good luck (literally: in the mouth of the wolf)",
    "exampleNative": "In bocca al lupo per il tuo esame!",
    "exampleEn": "Good luck on your exam!",
    "transliteration": "",
    "origin": "Dating back to Italian theater traditions, actors would wish each other to be 'in the wolf's mouth' before performances. The traditional response is 'Crepi il lupo' (May the wolf die), symbolizing overcoming danger and emerging victorious."
  },
  {
    "id": "pt-001",
    "languageCode": "pt-BR",
    "languageName": "Portuguese",
    "idiom": "Dar com os burros n'água",
    "meaningEn": "To fail completely (literally: to give with the donkeys in the water)",
    "exampleNative": "O projeto deu com os burros n'água.",
    "exampleEn": "The project failed completely.",
    "transliteration": "",
    "origin": "This idiom originates from Portuguese muleteers who would transport goods across rivers. If the donkeys panicked and fell into the water with their cargo, the entire expedition would fail catastrophically."
  },
  {
    "id": "tr-001",
    "languageCode": "tr-TR",
    "languageName": "Turkish",
    "idiom": "Balık baştan kokar",
    "meaningEn": "Corruption starts at the top (literally: fish rots from the head)",
    "exampleNative": "Şirketteki sorunlar balık baştan kokar diye gösteriyor.",
    "exampleEn": "The problems in the company show that it rots from the head.",
    "transliteration": "",
    "origin": "This Turkish proverb reflects centuries of wisdom about organizational leadership. Just as a fish begins to decay at its head, problems in any organization typically originate from its leadership."
  },
  {
    "id": "hi-002",
    "languageCode": "hi-IN",
    "languageName": "Hindi",
    "idiom": "अंधों में काना राजा",
    "meaningEn": "In the land of the blind, the one-eyed man is king",
    "exampleNative": "वह सबसे कम जानता है लेकिन अंधों में काना राजा है।",
    "exampleEn": "He knows the least but in the land of the blind, he's king.",
    "transliteration": "andhon mein kaana raaja",
    "origin": "This ancient Indian proverb illustrates relative superiority - someone with limited ability or knowledge can still be considered superior in an environment where everyone else has even less. It's been used in Sanskrit texts for millennia."
  },
  {
    "id": "es-002",
    "languageCode": "es-ES",
    "languageName": "Spanish",
    "idiom": "Costar un ojo de la cara",
    "meaningEn": "To cost an arm and a leg (literally: to cost an eye from the face)",
    "exampleNative": "Este coche me costó un ojo de la cara.",
    "exampleEn": "This car cost me an arm and a leg.",
    "transliteration": "",
    "origin": "This dramatic Spanish expression dates to medieval times when losing an eye in battle or duel was considered one of the greatest sacrifices. The phrase evolved to represent anything of extreme value or cost."
  },
  {
    "id": "fr-002",
    "languageCode": "fr-FR",
    "languageName": "French",
    "idiom": "Poser un lapin",
    "meaningEn": "To stand someone up (literally: to place a rabbit)",
    "exampleNative": "Il m'a posé un lapin hier soir.",
    "exampleEn": "He stood me up last night.",
    "transliteration": "",
    "origin": "In 19th century Parisian slang, a 'lapin' (rabbit) referred to a customer who left a restaurant without paying. The term evolved to mean anyone who fails to show up for an appointment or date, leaving the other person waiting."
  },
  {
    "id": "de-002",
    "languageCode": "de-DE",
    "languageName": "German",
    "idiom": "Die Katze im Sack kaufen",
    "meaningEn": "To buy something without inspecting it first (literally: to buy a cat in a bag)",
    "exampleNative": "Ich will das Auto sehen, bevor ich die Katze im Sack kaufe.",
    "exampleEn": "I want to see the car before buying a pig in a poke.",
    "transliteration": "",
    "origin": "This medieval expression warns against dishonest merchants who would sell a 'pig in a poke' (bag). Unscrupulous sellers might substitute a less valuable cat for the promised pig, and buyers who didn't inspect the bag would be cheated."
  },
  {
    "id": "ko-002",
    "languageCode": "ko-KR",
    "languageName": "Korean",
    "idiom": "눈 코 뜰 새 없다",
    "meaningEn": "To be extremely busy (literally: no time to open eyes or nose)",
    "exampleNative": "요즘 일이 많아서 눈 코 뜰 새가 없어.",
    "exampleEn": "I'm so busy these days I don't have a moment to spare.",
    "transliteration": "nun ko tteul sae eopda",
    "origin": "This vivid Korean expression suggests being so overwhelmed with work that you don't even have time for basic bodily functions like blinking or breathing. It reflects Korean work culture's intensity."
  },
  {
    "id": "ja-002",
    "languageCode": "ja-JP",
    "languageName": "Japanese",
    "idiom": "花より団子",
    "meaningEn": "Preferring practical things over aesthetics (literally: dumplings rather than flowers)",
    "exampleNative": "彼女は花より団子のタイプだ。",
    "exampleEn": "She's the type who prefers practical things over beauty.",
    "transliteration": "hana yori dango",
    "origin": "This Japanese saying originated during the Edo period when people would go flower viewing (hanami) but focus more on the food and sake than the blossoms. It gently mocks those who prioritize substance over style."
  },
  {
    "id": "zh-002",
    "languageCode": "zh-CN",
    "languageName": "Mandarin Chinese",
    "idiom": "对牛弹琴",
    "meaningEn": "To talk to someone who doesn't understand (literally: play lute to a cow)",
    "exampleNative": "跟他解释这个就像对牛弹琴。",
    "exampleEn": "Explaining this to him is like talking to a brick wall.",
    "transliteration": "duì niú tán qín",
    "origin": "This idiom comes from an ancient Chinese story about a musician who played beautiful music for a cow. The cow, unable to appreciate the art, simply continued grazing. It illustrates the futility of sharing sophisticated ideas with those unable to comprehend them."
  },
  {
    "id": "ar-002",
    "languageCode": "ar-SA",
    "languageName": "Arabic",
    "idiom": "على قد لحافك مد رجليك",
    "meaningEn": "Cut your coat according to your cloth (literally: stretch your legs according to your blanket)",
    "exampleNative": "يجب أن تعيش على قد لحافك مد رجليك.",
    "exampleEn": "You should live within your means.",
    "transliteration": "ala qadd lihaafik madd rijlayk",
    "origin": "This bedouin wisdom teaches financial prudence through the metaphor of sleeping arrangements. Just as you shouldn't stretch your legs beyond your blanket (or you'll get cold), you shouldn't spend beyond your means."
  },
  {
    "id": "ru-002",
    "languageCode": "ru-RU",
    "languageName": "Russian",
    "idiom": "Не в своей тарелке",
    "meaningEn": "To feel uncomfortable or out of place (literally: not in one's plate)",
    "exampleNative": "Я чувствую себя не в своей тарелке на этой вечеринке.",
    "exampleEn": "I feel out of place at this party.",
    "transliteration": "ne v svoey tarelke",
    "origin": "This phrase is actually a mistranslation from French 'ne pas être dans son assiette' (not being in one's usual state). Russian adopted it literally, creating a unique idiom about feeling uncomfortable, like food served on the wrong plate."
  },
  {
    "id": "it-002",
    "languageCode": "it-IT",
    "languageName": "Italian",
    "idiom": "Avere le mani in pasta",
    "meaningEn": "To be involved in something (literally: to have hands in dough)",
    "exampleNative": "Lui ha le mani in pasta in questo progetto.",
    "exampleEn": "He's deeply involved in this project.",
    "transliteration": "",
    "origin": "From Italian culinary tradition, this idiom refers to being elbow-deep in making pasta dough - a messy, hands-on process. It evolved to mean being deeply involved or having insider knowledge of a situation."
  },
  {
    "id": "pt-002",
    "languageCode": "pt-BR",
    "languageName": "Portuguese",
    "idiom": "Engolir sapos",
    "meaningEn": "To put up with unpleasant situations (literally: to swallow frogs)",
    "exampleNative": "Às vezes, a gente tem que engolir sapos no trabalho.",
    "exampleEn": "Sometimes we have to put up with unpleasant things at work.",
    "transliteration": "",
    "origin": "This Brazilian expression captures the disgusting feeling of having to accept humiliation or unfair treatment. The vivid image of swallowing a live frog perfectly represents tolerating something deeply unpleasant."
  },
  {
    "id": "tr-002",
    "languageCode": "tr-TR",
    "languageName": "Turkish",
    "idiom": "Kulağına küpe olmak",
    "meaningEn": "To take something as a lesson (literally: to become an earring to one's ear)",
    "exampleNative": "Bu hata sana kulağına küpe olsun.",
    "exampleEn": "Let this mistake be a lesson to you.",
    "transliteration": "",
    "origin": "In Ottoman Turkish culture, earrings were worn as reminders or good luck charms. This idiom suggests that a lesson should stay with you constantly, like an earring that remains in your ear as a permanent reminder."
  },
  {
    "id": "hi-003",
    "languageCode": "hi-IN",
    "languageName": "Hindi",
    "idiom": "नाक में दम करना",
    "meaningEn": "To make someone's life difficult (literally: to put life in the nose)",
    "exampleNative": "उसने मेरी नाक में दम कर दिया।",
    "exampleEn": "He made my life difficult.",
    "transliteration": "naak mein dam karna",
    "origin": "This colorful Hindi expression likely originates from the idea that breathing (dam/life force) becomes difficult when your nose is blocked or under pressure, metaphorically representing how someone can make your life unbearably difficult."
  },
  {
    "id": "es-003",
    "languageCode": "es-ES",
    "languageName": "Spanish",
    "idiom": "Tomar el pelo",
    "meaningEn": "To pull someone's leg (literally: to take the hair)",
    "exampleNative": "¿Me estás tomando el pelo?",
    "exampleEn": "Are you pulling my leg?",
    "transliteration": "",
    "origin": "This Spanish idiom may originate from the practice of barbers or pranksters literally pulling people's hair. It evolved to mean teasing or deceiving someone in a playful manner."
  },
  {
    "id": "fr-003",
    "languageCode": "fr-FR",
    "languageName": "French",
    "idiom": "Avoir un chat dans la gorge",
    "meaningEn": "To have a frog in one's throat (literally: to have a cat in the throat)",
    "exampleNative": "Je ne peux pas chanter, j'ai un chat dans la gorge.",
    "exampleEn": "I can't sing, I have a frog in my throat.",
    "transliteration": "",
    "origin": "While English speakers have 'frogs' in their throats, the French have 'cats.' This 17th century expression compares the scratchy, hoarse sound of a sore throat to a cat's scratching or meowing."
  },
  {
    "id": "de-003",
    "languageCode": "de-DE",
    "languageName": "German",
    "idiom": "Schwein haben",
    "meaningEn": "To be lucky (literally: to have pig)",
    "exampleNative": "Du hast aber Schwein gehabt!",
    "exampleEn": "You were really lucky!",
    "transliteration": "",
    "origin": "In medieval German tournaments, the losing contestant would receive a pig as a consolation prize. Getting a pig was considered fortunate since you at least won something valuable. Over time, 'having pig' came to mean being lucky in general."
  },
  {
    "id": "ko-003",
    "languageCode": "ko-KR",
    "languageName": "Korean",
    "idiom": "귀가 얇다",
    "meaningEn": "To be easily influenced (literally: to have thin ears)",
    "exampleNative": "그는 귀가 얇아서 쉽게 속는다.",
    "exampleEn": "He's easily influenced and gets fooled easily.",
    "transliteration": "gwiga yalpda",
    "origin": "This Korean idiom suggests that thin ears allow words to pass through too easily, making someone susceptible to persuasion or manipulation. It's been used for centuries to describe gullible individuals."
  },
  {
    "id": "ja-003",
    "languageCode": "ja-JP",
    "languageName": "Japanese",
    "idiom": "猿も木から落ちる",
    "meaningEn": "Even experts make mistakes (literally: even monkeys fall from trees)",
    "exampleNative": "プロでもミスする、猿も木から落ちるからね。",
    "exampleEn": "Even professionals make mistakes; nobody's perfect.",
    "transliteration": "saru mo ki kara ochiru",
    "origin": "Monkeys are renowned for their tree-climbing abilities, yet even they occasionally fall. This Japanese proverb, used since the Edo period, reminds us that expertise doesn't guarantee perfection - everyone makes mistakes sometimes."
  },
  {
    "id": "zh-003",
    "languageCode": "zh-CN",
    "languageName": "Mandarin Chinese",
    "idiom": "井底之蛙",
    "meaningEn": "Someone with a narrow perspective (literally: frog at the bottom of a well)",
    "exampleNative": "不要做井底之蛙，要多看看外面的世界。",
    "exampleEn": "Don't be narrow-minded; see more of the outside world.",
    "transliteration": "jǐng dǐ zhī wā",
    "origin": "This idiom comes from Zhuangzi's ancient Daoist text. A frog living at the bottom of a well can only see a small circle of sky and believes that's the entire universe. It warns against limited perspectives and ignorance of the broader world."
  },
  {
    "id": "ar-003",
    "languageCode": "ar-SA",
    "languageName": "Arabic",
    "idiom": "الطيور على أشكالها تقع",
    "meaningEn": "Birds of a feather flock together (literally: birds fall upon their kinds)",
    "exampleNative": "هم أصدقاء سيئون، الطيور على أشكالها تقع.",
    "exampleEn": "They're bad friends; birds of a feather flock together.",
    "transliteration": "at-tuyoor ala ashkaaliha taqa'",
    "origin": "This ancient Arabic proverb observes nature's patterns - birds naturally congregate with their own species. It's been used for centuries to describe how people tend to associate with others who share similar characteristics or values."
  },
  {
    "id": "ru-003",
    "languageCode": "ru-RU",
    "languageName": "Russian",
    "idiom": "Работать спустя рукава",
    "meaningEn": "To work carelessly (literally: to work with sleeves down)",
    "exampleNative": "Он работает спустя рукава.",
    "exampleEn": "He works carelessly.",
    "transliteration": "rabotat' spustya rukava",
    "origin": "In ancient Russia, traditional robes had very long sleeves that would get in the way of work. Serious workers would roll up their sleeves, while lazy ones would leave them down, working inefficiently. The phrase came to represent careless, half-hearted effort."
  },
  {
    "id": "it-003",
    "languageCode": "it-IT",
    "languageName": "Italian",
    "idiom": "Prendere due piccioni con una fava",
    "meaningEn": "To kill two birds with one stone (literally: to catch two pigeons with one bean)",
    "exampleNative": "Così prendiamo due piccioni con una fava.",
    "exampleEn": "This way we kill two birds with one stone.",
    "transliteration": "",
    "origin": "This Italian version of a universal concept uses the image of catching two pigeons with a single fava bean used as bait. It emphasizes efficiency and cleverness in solving multiple problems with one action."
  },
  {
    "id": "pt-003",
    "languageCode": "pt-BR",
    "languageName": "Portuguese",
    "idiom": "Pagar o pato",
    "meaningEn": "To take the blame (literally: to pay the duck)",
    "exampleNative": "Eu não fiz nada, mas vou ter que pagar o pato.",
    "exampleEn": "I didn't do anything, but I'll have to take the blame.",
    "transliteration": "",
    "origin": "This Brazilian idiom possibly originates from colonial times when someone would be made to pay for a duck at the market as punishment for something they didn't do, serving as a scapegoat for others' misdeeds."
  },
  {
    "id": "tr-003",
    "languageCode": "tr-TR",
    "languageName": "Turkish",
    "idiom": "Gözü yükseklerde olmak",
    "meaningEn": "To be ambitious (literally: to have eyes high)",
    "exampleNative": "Onun gözü hep yükseklerdedir.",
    "exampleEn": "He's always very ambitious.",
    "transliteration": "",
    "origin": "This Turkish expression captures the physical act of looking upward toward higher goals. It reflects the Ottoman cultural value of ambition and aspiration, comparing ambitious people to those who literally keep their gaze fixed on elevated targets."
  },
  {
    "id": "hi-004",
    "languageCode": "hi-IN",
    "languageName": "Hindi",
    "idiom": "हाथ कंगन को आरसी क्या",
    "meaningEn": "No need to prove the obvious (literally: why does a bracelet need a mirror)",
    "exampleNative": "उसकी योग्यता सबको पता है, हाथ कंगन को आरसी क्या।",
    "exampleEn": "Everyone knows his competence; no need to prove the obvious.",
    "transliteration": "haath kangan ko aarsi kya",
    "origin": "This ancient Hindi proverb asks a rhetorical question: why would you need a mirror to see a bracelet on your own hand? It's already visible to you. Similarly, some truths are so self-evident they require no proof or explanation."
  },
  {
    "id": "es-004",
    "languageCode": "es-ES",
    "languageName": "Spanish",
    "idiom": "No tener pelos en la lengua",
    "meaningEn": "To be blunt or straightforward (literally: to not have hairs on the tongue)",
    "exampleNative": "María no tiene pelos en la lengua.",
    "exampleEn": "Maria doesn't mince words.",
    "transliteration": "",
    "origin": "This Spanish idiom suggests that hair on the tongue would muffle or soften speech. Someone without such impediment speaks directly and honestly, without filtering or softening their words."
  },
  {
    "id": "fr-004",
    "languageCode": "fr-FR",
    "languageName": "French",
    "idiom": "Mettre son grain de sel",
    "meaningEn": "To give unsolicited advice (literally: to put one's grain of salt)",
    "exampleNative": "Il faut toujours qu'il mette son grain de sel.",
    "exampleEn": "He always has to give his two cents.",
    "transliteration": "",
    "origin": "In French cuisine, adding just a grain of salt can change a dish's entire flavor. This idiom evolved to describe people who can't resist adding their opinion to conversations, even when it wasn't requested."
  },
  {
    "id": "de-004",
    "languageCode": "de-DE",
    "languageName": "German",
    "idiom": "Jemandem einen Bären aufbinden",
    "meaningEn": "To pull someone's leg (literally: to tie a bear on someone)",
    "exampleNative": "Er hat mir einen Bären aufgebunden!",
    "exampleEn": "He pulled my leg!",
    "transliteration": "",
    "origin": "This medieval German expression comes from traveling showmen who would 'tie' their trained bears to unsuspecting villagers, then demand payment for taking them back. It came to mean tricking someone with an elaborate lie."
  },
  {
    "id": "ko-004",
    "languageCode": "ko-KR",
    "languageName": "Korean",
    "idiom": "발이 넓다",
    "meaningEn": "To know many people (literally: to have wide feet)",
    "exampleNative": "그는 발이 넓어서 어디서든 아는 사람을 만난다.",
    "exampleEn": "He knows so many people he meets someone everywhere.",
    "transliteration": "bari neolpda",
    "origin": "This Korean idiom compares wide social networks to wide feet that can step in many different places. Someone with 'wide feet' has connections across various social circles and places."
  },
  {
    "id": "ja-004",
    "languageCode": "ja-JP",
    "languageName": "Japanese",
    "idiom": "口が軽い",
    "meaningEn": "Cannot keep a secret (literally: to have a light mouth)",
    "exampleNative": "彼は口が軽いから秘密を教えないほうがいい。",
    "exampleEn": "He can't keep secrets, so don't tell him.",
    "transliteration": "kuchi ga karui",
    "origin": "In Japanese, a 'light mouth' suggests words slip out too easily, like objects falling from a bag that's not properly secured. This centuries-old expression warns against trusting gossips with sensitive information."
  },
  {
    "id": "zh-004",
    "languageCode": "zh-CN",
    "languageName": "Mandarin Chinese",
    "idiom": "班门弄斧",
    "meaningEn": "To show off in front of an expert (literally: wielding an axe at Lu Ban's door)",
    "exampleNative": "在专家面前表现自己就是班门弄斧。",
    "exampleEn": "Showing off in front of experts is embarrassing.",
    "transliteration": "bān mén nòng fǔ",
    "origin": "Lu Ban was a legendary Chinese carpenter and engineer. This idiom asks: why would anyone demonstrate axe skills at Lu Ban's house? It mocks the foolishness of trying to impress experts in their own field."
  },
  {
    "id": "ar-004",
    "languageCode": "ar-SA",
    "languageName": "Arabic",
    "idiom": "من جد وجد",
    "meaningEn": "Hard work pays off (literally: who perseveres finds)",
    "exampleNative": "واصل العمل، من جد وجد.",
    "exampleEn": "Keep working; hard work pays off.",
    "transliteration": "man jadda wajada",
    "origin": "This concise Arabic proverb has been used for over a millennium to encourage persistence. Its rhythmic structure and clear message have made it one of the most quoted sayings in Arabic literature and daily life."
  },
  {
    "id": "ru-004",
    "languageCode": "ru-RU",
    "languageName": "Russian",
    "idiom": "Душа в пятки ушла",
    "meaningEn": "To be scared (literally: soul went to the heels)",
    "exampleNative": "Когда я увидел медведя, душа в пятки ушла.",
    "exampleEn": "When I saw the bear, I was scared to death.",
    "transliteration": "dusha v pyatki ushla",
    "origin": "This vivid Russian expression describes extreme fear by suggesting your soul drops from your body down to your heels - about as far from your heart and head as possible, symbolizing the complete loss of courage."
  },
  {
    "id": "it-004",
    "languageCode": "it-IT",
    "languageName": "Italian",
    "idiom": "Costare un occhio della testa",
    "meaningEn": "To cost a fortune (literally: to cost an eye from the head)",
    "exampleNative": "Questa macchina mi è costata un occhio della testa.",
    "exampleEn": "This car cost me a fortune.",
    "transliteration": "",
    "origin": "This Italian expression uses the extreme sacrifice of losing an eye to represent something prohibitively expensive. It reflects the Renaissance Italian understanding that some of the most valuable things require the greatest sacrifices."
  },
  {
    "id": "pt-004",
    "languageCode": "pt-BR",
    "languageName": "Portuguese",
    "idiom": "Matar dois coelhos com uma cajadada só",
    "meaningEn": "To kill two birds with one stone (literally: kill two rabbits with one blow)",
    "exampleNative": "Vou ao mercado e ao banco, matando dois coelhos com uma cajadada só.",
    "exampleEn": "I'll go to the market and bank, killing two birds with one stone.",
    "transliteration": "",
    "origin": "This Brazilian variant uses rabbits instead of birds and a 'cajadada' (blow from a staff) instead of a stone. It reflects the agricultural heritage where farmers would efficiently dispatch multiple pests with a single action."
  }
]
